# Lesson 4 Practice: Pandas Part 2

Use this notebook to follow along with the lesson in the corresponding lesson notebook: [L04-Pandas_Part2-Lesson.ipynb](./L04-Pandas_Part2-Lesson.ipynb).

## Instructions
Follow along with the teaching material in the lesson. Throughout the tutorial sections labeled as "Tasks" are interspersed and indicated with the icon: ![Task](http://icons.iconarchive.com/icons/sbstnblnd/plateau/16/Apps-gnome-info-icon.png). You should follow the instructions provided in these sections by performing them in the practice notebook.  When the tutorial is completed you can turn in the final practice notebook. For each task, use the cell below it to write and test your code.  You may add additional cells for any task as needed or desired.

## Task 1a: Setup

- import pandas
- re-create the `df` data frame
- re-create the `iris_df` data frame

In [2]:
import numpy as np
import pandas as pd
df = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})
iris_df = pd.read_csv('data/iris.csv')
df
iris_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

## Task 2a: Inserting Columns

+ Create a copy of the `df` dataframe.
+ Add a new column named "delta" to the copy that consists of random numbers.

In [3]:
df_copy = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})
df_copy['gamma'] = np.random.random((5,1))
df_copy

   alpha beta     gamma
0      0    a  0.337002
1      1    b  0.498672
2      2    c  0.748710
3      3    d  0.875315
4      4    e  0.686722

## Task 3a: Missing Data

+ Create two new copies of the `df` dataframe:
+ Add a new column to both that has missing values.
+ In one copy, replace missing values with a value of your choice.
+ In the other copy, drop rows with `NaN` values.
+ Print both arrays to confirm.

In [4]:
df_copy2 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})
df_copy3 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})
df_copy2['theta'] = pd.Series([1,2,3])
df_copy2
df_copy3['epsilon'] = pd.Series([4,5,6,7])
df_copy3
df_copy2.dropna()
df_copy3.fillna(0)

   alpha beta  epsilon
0      0    a      4.0
1      1    b      5.0
2      2    c      6.0
3      3    d      7.0
4      4    e      0.0

## Task 4a: Operations
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

View the [Computational tools](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html) and [statistical methods](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#method-summary) documentation.
Using the list of operational functions choose five functions to use with the iris data frame.

In [5]:
iris_df.cov()
iris_df.mean()
iris_df.corr()
iris_df.min()
iris_df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

## Task 4b:  Apply

Practice using `apply` on either the `df` or `iris_df` data frames using any two functions of your choice other than `print`, `type`, and `np.sum`.

In [6]:
iris_df.apply(np.max)
iris_df.apply(np.min)

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

## Task 4c.  Occurances
Ientify the number of occurances for each species (virginica, versicolor, setosa) in the `iris_df` object.  *Hint*: the `value_counts` function only works on a `pd.Series` object, not on the full data frame..

In [7]:
species = iris_df.loc[0:150, 'species']
species
species.value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

## Task 5a: String Methods

+ Create a list of five strings that represent dates in the form YYYY-MM-DD (e.g. 2020-02-20 for Feb 20th, 2020).
+ Add this list of dates as a new column in the `df` dataframe.
+ Now split the date into 3 new columns with one column representing the year, another the month and another they day.
+ Combine the values from columns `alpha` and `beta` into a new column where the values are spearated with a colon.

In [8]:
df4 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})
df4['dates'] = ['2018-05-15', '2019-02-25', '2019-05-23', '2019-12-03', '2020-01-01']
df4
split_1, split_2, split_3 = df4['dates'].str.split('-').str
split_1
df4['split_1'], df4['split_2'], df4['split_3'] = df4['dates'].str.split('-', 2).str
df4
df4['alpha'] = df['alpha'].astype(str)
df4['lambda'] = df4['alpha'] + df4['beta']

## Task 6a: Concatenation by Rows
+ Create the following dataframe
```Python
df1 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
```
+ Create a new dataframe named `df2` with column names "delta" and "gamma" that contins 5 rows with some index names that overlap with the `df1` dataframe and some that do not.
+ Concatenate the two dataframes by rows and print the result.
+ You should see the two have combined one after the other, but there should also be missing values added. 
+ Explain why there are missing values.

In [9]:
df1 = pd.DataFrame(
  {'alpha': [0, 1, 2, 3, 4],
   'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
df2 = pd.DataFrame(
  {'delta': [0, 1, 2, 3, 4],
   'gamma': ['a', 'b', 'c', 'd', 'e']}, index = ['I6', 'I2' ,'I8', 'I4', 'I7'])
subsets = [df1, df2]
newdf = pd.concat(subsets)
newdf

#There are missing values because in df1 there is no delta and gamma column and in df2 there is no alpha and beta columns

C:\Users\Richard\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

    alpha beta  delta gamma
I1    0.0    a    NaN   NaN
I2    1.0    b    NaN   NaN
I3    2.0    c    NaN   NaN
I4    3.0    d    NaN   NaN
I5    4.0    e    NaN   NaN
I6    NaN  NaN    0.0     a
I2    NaN  NaN    1.0     b
I8    NaN  NaN    2.0     c
I4    NaN  NaN    3.0     d
I7    NaN  NaN    4.0     e

## Task 6b: Concatenation by Columns

Using the same dataframes, df1 and df2, from Task 6a practice:
+ Concatenate the two by columns
+ Add a "delta" column to `df1` and concatenate by columns such that there are 5 columns in the merged dataframe.
+ Respond in writing to this question (add a new 'raw' cell to contain your answer). What will happen if using you had performed an inner join while concatenating?  
+ Try the concatenation with the inner join to see if you are correct.

In [10]:
df1 = pd.DataFrame(
  {'alpha': [0, 1, 2, 3, 4],
   'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
df2 = pd.DataFrame(
  {'delta': [0, 1, 2, 3, 4],
   'gamma': ['a', 'b', 'c', 'd', 'e']}, index = ['I6', 'I2' ,'I8', 'I4', 'I7'])
df1['delta'] = [5, 6, 7, 8, 9]
df1
pd.concat([df1, df2], axis=1)
pd.concat([df1, df2], axis=1, join='inner')

C:\Users\Richard\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  if __name__ == '__main__':

    alpha beta  delta  delta gamma
I2      1    b      6      1     b
I4      3    d      8      3     d

An inner join would not show any of the columns with NaN in them.

#### Task 6c: Concat and append data frames
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

+ Create a new 5x5 dataframe full of random numbers.
+ Create a new 5x10 dataframe full of 1's.
+ Append one to the other and print it.
+ Append a single Series of zeros to the end of the appended dataframe.

In [11]:
df5 = pd.DataFrame(np.random.random((5,5)))
df6 = pd.DataFrame(np.ones((5,10)))
df5_2= df5.append(df6, ignore_index=True)
df7 = pd.Series(np.zeros(10))
df5_2.append(df7, ignore_index=True)

           0         1         2         3         4    5    6    7    8    9
0   0.587519  0.544835  0.399873  0.138276  0.741532  NaN  NaN  NaN  NaN  NaN
1   0.473637  0.320073  0.544258  0.956978  0.417755  NaN  NaN  NaN  NaN  NaN
2   0.085523  0.895031  0.393870  0.537135  0.151102  NaN  NaN  NaN  NaN  NaN
3   0.261381  0.273359  0.363686  0.895739  0.847885  NaN  NaN  NaN  NaN  NaN
4   0.625445  0.508243  0.074408  0.712042  0.783721  NaN  NaN  NaN  NaN  NaN
5   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
6   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
7   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
8   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
9   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
10  0.000000  0.000000  0.000000  0.000000  0.000000  0.0  0.0  0.0  0.0  0.0

## Task 6d: Grouping

Demonstrate a `groupby`.

+ Create a new column with the label "region" in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'. Use these randomly.
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add a `dev_stage` column by randomly selecting from the values "early" and "late".
+ Use `groupby` to get a new data frame of means for each species,in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.

In [13]:
iris_df['region'] = np.random.choice(['Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'], iris_df.shape[0])
iris_df.head()
iris_group1 = iris_df.groupby(['species', 'region'])
iris_group1.mean()
iris_df['dev_stage'] = np.random.choice(['early', 'late'], iris_df.shape[0])
iris_df.head()
iris_group2 = iris_df.groupby(['species', 'region', 'dev_stage'])
iris_group2
iris_group2.mean()
iris_group2.count()

                      sepal_length  sepal_width  petal_length  petal_width
species    region
setosa     Midwest        5.000000     3.423077      1.507692     0.246154
           Northeast      4.900000     3.336364      1.490909     0.263636
           Northwest      4.950000     3.375000      1.400000     0.275000
           Southeast      5.100000     3.472222      1.438889     0.244444
           Southwest      4.950000     3.425000      1.425000     0.150000
versicolor Midwest        6.060000     2.940000      4.320000     1.360000
           Northeast      5.920000     2.766667      4.320000     1.360000
           Northwest      6.055556     2.788889      4.244444     1.333333
           Southeast      5.891667     2.700000      4.291667     1.283333
           Southwest      5.833333     2.755556      4.100000     1.300000
virginica  Midwest        6.655556     2.977778      5.577778     1.966667
           Northeast      6.050000     3.050000      5.175000     2.200000
           Northwest      6.330000     2.830000      5.480000     1.960000
           Southeast      6.609091     2.890909      5.509091     2.072727
           Southwest      6.831250     3.100000      5.706250     2.025000